# CoverOffset Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricArea..::..CoverOffset Property
FabricArea Class See Also
---
The additional cover offset of the fabric distribution.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CoverOffset { get; set; }
```

Visual Basic
---
```text
Public Property CoverOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CoverOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: coverOffset is greater then the host thickness. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace